preconcentrationCE/Sample_stacking/2_50_1_sample_stacking/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     electroMicroTransport;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2400.;

deltaT          1e-9;

writeControl    adjustableRunTime;

writeInterval   10.;

purgeWrite      0;

writeFormat     ascii;

writePrecision  9; 

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;//no;

maxCo           0.45;
//maxDeltaT       0.25;

// ************************************************************************* //
